[
    {
        "date": "2024-10-3T11:01:00.000Z",
        "title": "Programming for Non-Programmers | 1 - Introduction to Programming",
        "thumbnail": "https://i.vimeocdn.com/video/1933907122-bbc56934a119e684787fdb93d0dbe3006bb816bc66e0d8d20589d56798b03e74-d_640x360",
        "description": "Want to learn how to write a computer program but don't know where to start? Then this video series is for you! I'm Jordan with Damn Good Technology. This video is for people new to programming who want to know how to write computer programs. Whether you just want to know how to write apps for fun, or you want a way to advance in your career, then I'd love to have you along on this journey as I show you how to go from not knowing how to program to being a programming whiz! In this first video I won't be doing any programming. Instead, I'll be setting expectations. I recommend watching this video but not putting too much emotional energy into digesting it. Perhaps save it for later and watch it again when you're feeling down about your abilities. You got this! I'll be with you every step of the way in your journey. If you'd like to connect with me (or if your team is looking for a tech lead), I'd love to connect! You can connect with me on X, Mastodon, LinkedIn, or any other social media platform you choose at",
        "url": "https://vimeo.com/1015798460"
    },
    {
        "date": "2024-9-25T16:46:00.000Z",
        "title": "Senior Software / Tech Lead Developer - Live Coding with NO FILTER OR EDITS",
        "thumbnail": "https://i.vimeocdn.com/video/1930894177-15051b9c01b577ef9c90dd10c85b908b677d0e6e77fe6850fc00b728386772e8-d_640x360",
        "description": "As you're learning programming, it may feel daunting to look up to experienced developers and think they got it all together. Really, we don't! In this video, I walk through a live example of how I program. We're smack dab in the middle of a Firefox extension I'm developing, and I show you how I find the root cause of programs, how I take various rabbit trails, and what parts of the code I leave on the cutting room floor. If your team is needing a tech lead with over 12 years of experience, and a generous ambitious spirit, I'd love to chat! Please visit damngood.tech so I can have the pleasure of working with your awesome team on your cool project! For the curious, the tech stack is a webextension using the vite build system with a Vue frontend. I'm using dexie for the frontend database with light pinia usage (not entirely shown in the video). At the time of recording I hadn't pushed anything to the repo, but I may soon. No matter what experience level -- junior, mid, or senior, I hope you get value from this video. If you found it useful, please like and share with a colleague that you think would find it valuable.",
        "url": "https://vimeo.com/1012972687"
    },
    {
        "date": "2024-07-14T09:41:01.000Z",
        "title": "No more Salesforce! - 4 Alternative CRMs and How To Choose",
        "description": "Salesforce has become one of the leading Customer Relationship Management platforms for decades. However, companies are finding the platform is often unwieldy or downright wonky. In today's video I'll walk through 4 alternative CRMs you can try in order to help your team decrease technical debt and focus on you and your customers. If you found this video helpful, be sure to share with a colleague. Comment below if I forgot a CRM! Please like and subscribe to damngoodtech on Rumble! --- If you or your team is looking for a quality tech lead, send me an email to jordan@damngood.tech",
        "thumbnail": "https://hugh.cdn.rumble.cloud/s/s8/1/U/a/3/k/Ua3ks.qR4e-small-No-more-Salesforce-4-Altern.jpg",
        "url": "https://rumble.com/v51hpgu-no-more-salesforce-4-alternative-crms-and-how-to-choose.html"
    },
    {
        "date": "2024-06-29T01:40:54.000Z",
        "title": "WORST REACT NATIVE LLM VIDEO EVER!!!",
        "thumbnail": "https://hugh.cdn.rumble.cloud/s/s8/1/X/V/S/0/XVS0r.qR4e-small-WORST-REACT-NATIVE-LLM-VIDE.jpg",
        "url": "https://rumble.com/v4y171t-worst-react-native-llm-video-ever.html",
        "description": "If your team is looking for a tech lead to solve complex programming problems, reach out! You can send an email to jordan@damngood.tech to schedule a free consultation! --- Large Language Models have garnered a lot of hype over the years. However, despite the hype, LLMs are a powerful tool that can aide you in solving complex programming problems. In this video I'll walk through how I use LLMs to get unstuck from a problem in a react native application. I'm using the continue vscode extension with a local llama-based deepseek-coder model; however, the same concepts apply whether you're using ChatGPT, GitHub Copilot, or Continue's own server. Continue: https://continue.dev Jordan Hewitt, Damn Good Tech: https://damngood.tech"
    },
    {
        "date": "2024-04-07T00:16:48.000Z",
        "title": "How to Make Project Estimates Suck Less",
        "thumbnail": "https://hugh.cdn.rumble.cloud/s/s8/1/9/z/L/l/9zLlq.oq1b-small-How-to-Make-Project-Estimat.jpg",
        "url": "https://rumble.com/v4hmlbx-how-to-make-project-estimates-suck-less.html",
        "description": "Hello folks, today we are talking about something that is oh so fun - project estimates! I am here here to help you with decision making and provide recommendations. Project estimates, what are they? Well, they are crucial for any project. They help you determine the steps required for the final deliverable, as well as the time it would take to complete each step. During the process, it's essential to consider potential challenges and setbacks that may arise. By doing so, you can create a more accurate estimate and avoid unexpected delays. In addition, it's important to communicate openly with your team members and clients to ensure everyone is on the same page and understands the project scope. Let's say you're tasked with setting up a database. You would need to research the data base, set up the tables, and migrate the data. Each step might take different amounts of time depending on various factors. To create an accurate estimate, you could break down the process into smaller tasks and assign time constraints for each task. This will help you determine how long it would take to complete each step and ultimately, the entire project. However, sometimes things don't go as planned. When this happens, it's essential to communicate with your team and clients about any changes in the project scope or timeline. Communication is key! Remember that you can always adjust your project estimate as needed based on new information or changes in requirements. Keep in mind that project estimates are not just about the final deliverable but also about the journey to get there. So, always strive for excellence, be creative, and keep learning from your experiences to become a better developer. Thanks for watching! Don't forget to subscribe to Damn Good Tech for more tech tips and tricks."
    }
]