[
    {
        "date": "2024-06-29T01:40:54.000Z",
        "title": "WORST REACT NATIVE LLM VIDEO EVER!!!",
        "thumbnail": "https://hugh.cdn.rumble.cloud/s/s8/1/X/V/S/0/XVS0r.qR4e-small-WORST-REACT-NATIVE-LLM-VIDE.jpg",
        "url": "https://rumble.com/v4y171t-worst-react-native-llm-video-ever.html",
        "description": "If your team is looking for a tech lead to solve complex programming problems, reach out! You can send an email to jordan@damngood.tech to schedule a free consultation! --- Large Language Models have garnered a lot of hype over the years. However, despite the hype, LLMs are a powerful tool that can aide you in solving complex programming problems. In this video I'll walk through how I use LLMs to get unstuck from a problem in a react native application. I'm using the continue vscode extension with a local llama-based deepseek-coder model; however, the same concepts apply whether you're using ChatGPT, GitHub Copilot, or Continue's own server. Continue: https://continue.dev Jordan Hewitt, Damn Good Tech: https://damngood.tech"
    },
    {
        "date": "2024-04-07T00:16:48.000Z",
        "title": "How to Make Project Estimates Suck Less",
        "thumbnail": "https://hugh.cdn.rumble.cloud/s/s8/1/9/z/L/l/9zLlq.oq1b-small-How-to-Make-Project-Estimat.jpg",
        "url": "https://rumble.com/v4hmlbx-how-to-make-project-estimates-suck-less.html",
        "description": "Hello folks, today we are talking about something that is oh so fun - project estimates! I am here here to help you with decision making and provide recommendations. Project estimates, what are they? Well, they are crucial for any project. They help you determine the steps required for the final deliverable, as well as the time it would take to complete each step. During the process, it's essential to consider potential challenges and setbacks that may arise. By doing so, you can create a more accurate estimate and avoid unexpected delays. In addition, it's important to communicate openly with your team members and clients to ensure everyone is on the same page and understands the project scope. Let's say you're tasked with setting up a database. You would need to research the data base, set up the tables, and migrate the data. Each step might take different amounts of time depending on various factors. To create an accurate estimate, you could break down the process into smaller tasks and assign time constraints for each task. This will help you determine how long it would take to complete each step and ultimately, the entire project. However, sometimes things don't go as planned. When this happens, it's essential to communicate with your team and clients about any changes in the project scope or timeline. Communication is key! Remember that you can always adjust your project estimate as needed based on new information or changes in requirements. Keep in mind that project estimates are not just about the final deliverable but also about the journey to get there. So, always strive for excellence, be creative, and keep learning from your experiences to become a better developer. Thanks for watching! Don't forget to subscribe to Damn Good Tech for more tech tips and tricks."
    }
]